In [2]:
import pandas as pd
import numpy as np

- Una que se llame "valores" que tenga 7 números aleatorios.

- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [3]:
valores = [1, 2, 3, 4, 5, 6, 7]
indices = ["Lunes", "Martes", "Miércoles", "Jueves", "Viernes", "Sábado", "Domingo"]

In [4]:
valores

[1, 2, 3, 4, 5, 6, 7]

In [5]:
indices

['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado', 'Domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [6]:
serie1 = pd.Series(valores, index = [indices])
serie1

Lunes        1
Martes       2
Miércoles    3
Jueves       4
Viernes      5
Sábado       6
Domingo      7
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método

In [7]:
dicc = {}

In [8]:
for i in zip(indices, valores):
    dicc.update(zip(indices, valores))

In [9]:
dicc

{'Lunes': 1,
 'Martes': 2,
 'Miércoles': 3,
 'Jueves': 4,
 'Viernes': 5,
 'Sábado': 6,
 'Domingo': 7}

Crea una Serie con el diccionario creado en el punto anterior.

In [10]:
serie2 = pd.Series(dicc)
serie2

Lunes        1
Martes       2
Miércoles    3
Jueves       4
Viernes      5
Sábado       6
Domingo      7
dtype: int64

In [11]:
#forma de la ultima serie
serie2.shape

(7,)

In [12]:
serie2.size

7

In [13]:
serie2.dtypes

dtype('int64')

In [14]:
serie2.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

In [15]:
serie2.values

array([1, 2, 3, 4, 5, 6, 7])

Extraed el valor para el índice "lunes", "martes" y "miércoles".

In [16]:
serie2[:3]

Lunes        1
Martes       2
Miércoles    3
dtype: int64

In [17]:
serie2[[0,6]]

Lunes      1
Domingo    7
dtype: int64

Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [18]:
import numpy as np

In [19]:
paises = np.random.rand(4,3)
paises

array([[0.29777279, 0.80559514, 0.9147008 ],
       [0.95049849, 0.13030061, 0.97908781],
       [0.9922912 , 0.85825157, 0.85971237],
       [0.21597513, 0.87619857, 0.53726538]])

In [20]:
paises.ndim

2

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [21]:
dfpaises = pd.DataFrame(paises)
dfpaises

          0         1         2
0  0.297773  0.805595  0.914701
1  0.950498  0.130301  0.979088
2  0.992291  0.858252  0.859712
3  0.215975  0.876199  0.537265

In [22]:
dfpaises = pd.DataFrame(paises, columns = ["España", 'Francia', 'Italia'])
dfpaises

     España   Francia    Italia
0  0.297773  0.805595  0.914701
1  0.950498  0.130301  0.979088
2  0.992291  0.858252  0.859712
3  0.215975  0.876199  0.537265

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

In [23]:
df = pd.read_csv("datos/medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

Usando el loc extraed todas las columnas de la fila de Tailandia.

In [24]:
df.loc[['Tailandia']]

           Unnamed: 0  Oro  Plata  Bronce
País
Tailandia           7  132    175     278

Usando el loc extraed todas las columnas de China e Irán.

In [27]:
df.loc[['China','Irán']]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [28]:
df.loc[['China','Irán'], ['Oro', 'Plata', 'Bronce']]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el iloc extraed la información de la India. Devolved todas las columnas.

In [29]:
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [36]:
df.iloc[[5]]

       Unnamed: 0  Oro  Plata  Bronce
País
India           6  154    202     315

Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [40]:
df.iloc[1:10:2, :]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [60]:
df.iloc[:10, 1:4]

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

¿Qué país consiguió más de 200 medallas de oro?

In [49]:
df.loc[df["Oro"] > 200]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [52]:
df.loc[(df["Oro"] > 200) & (df["Plata"] > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [53]:
df.loc[(df["Oro"] > 200) & (df["Bronce"] > 700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [58]:
df.drop(['Unnamed: 0'], axis =1)

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [56]:
df.assign(total= (df['Oro'] + df['Plata'] + df['Bronce']))

                 Unnamed: 0   Oro  Plata  Bronce  total
País
China                     1  1473    994     720   3187
Japón                     2  1032   1037     985   3054
Corea del Sur             3   745    663     827   2235
Irán                      4   179    181     197    557
Kazajistán                5   155    158     224    537
India                     6   154    202     315    671
Tailandia                 7   132    175     278    585
Indonesia                 8   112    131     240    483
China Taipéi              9    99    144     276    519
Corea del Norte          10    91    120     235    446